

#用户状态
USER_STATUS_CHOICES = (
    ('0','正常'),
    ('1','到期'),
    ('2','冻结'),
)

#登录类别
LOGIN_TYPES_CHOICES = (
    ('0','登录账号密码登录'),
    ('1','手机号密码登录'),
    ('5','微信小程序授权登录'),
    ('6','手机号验证码登录'),
)

#端
APP_TYPES_CHOICES = (
    ('0', 'PC管理端'),
    ('1', '移动用户端'),
)

#角色类型
ROLE_TYPES_CHOICES = (
    ('1', '系统管理员'),
    ('2', '商户管理员'),
    ('3', '用户'),
)

# 菜单类型
MENU_TYPES_CHOICES = (
    ('0', '菜单'),
    ('1', '按钮'),
    ('2', '内页'),
)

# 菜单是否缓存
KEEP_CHOICES = (
    ('0', '是'),
    ('1', '否'),
)

# 订单状态
ORDER_STATUS_CHOICES = (
    ('0', '待付款'),
    ('1', '待发货'),
    ('2', '已发货'),
    ('3', '已完成'),
    ('4', '已取消'),
    ('5', '已关闭'),
    ('6', '退款中'),
)

#订单来源
ORDER_SOURCE_CHOICES = (
    ('0', '安卓APP'),
    ('1', '苹果APP'),
    ('3', '微信小程序'),
    ('4', '支付宝小程序'),
    ('5', '百度小程序'),
    ('6', '抖音小程序'),
)

#订单支付方式
ORDER_PAYTYPE_CHOICES = (
    ('0', '微信支付'),
    ('1', '支付宝支付'),
    ('2', '银联支付'),
)

#退款状态
REFUND_STATUS_CHOICES = (
    ('0', '申请退款'),
    ('1', '正在退款'),
    ('2', '退款成功'),
    ('3', '拒绝退款'),
)